OdDAI.DerivedAttribute.expression
\details
Returns an expression of the derived attribute.
\returns Returns an expression of the derived attribute.

OdDAI.DerivedAttribute.evaluate(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst)
\details
Evaluates a nested expression and gets a calculated value.
\param inst [in] Smart pointer to an application instance representing a nested expression.
\returns Calculated value.

OdDAI.DerivedAttribute.getAttributeType
\details
Retrieves the current attribute's type.
\returns An enumeration that contains the attribute's type.

OdDAI.DerivedAttribute.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.DerivedAttribute.redeclaring
\details
Retrieves definition of redeclared attribute.
\returns Returns a smart pointer to the container with definition of redeclared attribute.

OdDAI.DerivedAttribute.domain
\details
Retrieves data type referenced by the attribute.
\returns Returns a smart pointer to the data type.

OdDAI.DerivedAttribute.Dispose
\details
Destructor.

OdDAI.DerivedAttribute.#ctor
\details
Creates a new attribute object with default parameters.

OdDAI.DerivedAttribute
\details
A class that implements the storing and manipulating of attributes.